package main

import (
	"bytes"
	"strings"
	"testing"
)

func Test_run_solve(t *testing.T) {
	test_run(t, solve)
}

func test_run(t *testing.T, solve solveFunc) {
	tests := []struct {
		name    string
		input   string
		wantOut string
		debug   bool
	}{
		{
			"1",
			`4 3 5 2 5`,
			`5 5`,
			true,
		},
		{
			"2",
			`-4 3 -5 2 5`,
			`-5 -4`,
			true,
		},
		{
			"3",
			`12288 -10075 29710 15686 -18900 -17715 15992 24431 6220 28403 -23148 18480 -22905 5411 -7602 15560 -26674 11109 -4323 6146 -1523 4312 10666 -15343 -17679 7284 20709 -7103 24305 14334 -12281 17314 26061 25616 17453 16618 -24230 -19788 21172 11339 2202 -22442 -20997 1879 -8773 -8736 5310 -23372 12621 -25596 -28609 -13309 -13 10336 15812 -21193 21576 -1897 -12311 -6988 -25143 -3501 23231 26610 12618 25834 -29140 21011 23427 1494 15215 23013 -15739 8325 5359 -12932 18111 -72 -12509 20116 24390 1920 17487 25536 24934 -6784 -16417 -2222 -16569 -25594 4491 14249 -28927 27281 3297 5998 6259 4577 12415 3779 -8856 3994 19941 11047 2866 -24443 -17299 -9556 12244 6376 -13694 -14647 -22225 21872 7543 -6935 17736 -2464 9390 1133 18202 -9733 -26011 13474 29793 -26628 -26124 27776 970 14277 -23213 775 -9318 29014 -5645 -27027 -21822 -17450 -5 -655 22807 -20981 16310 27605 -18393 914 7323 599 -12503 -28684 5835 -5627 25891 -11801 21243 -21506 22542 -5097 8115 178 10427 25808 10836 -11213 18488 21293 14652 12260 42 21034 8396 -27956 13670 -296 -757 18076 -15597 4135 -25222 -19603 8007 6012 2704 28935 16188 -20848 13502 -11950 -24466 5440 26348 27378 7990 -11523 -26393 `,
			`29710 29793`,
			true,
		},
		{
			"два положительных по возрастанию",
			`10 20`,
			`10 20`,
			true,
		},
		{
			"два положительных по убыванию",
			`20 10`,
			`10 20`,
			true,
		},
		{
			"три числа",
			`20 10 30`,
			`20 30`,
			true,
		},
		{
			"последнее втрой максимум",
			`30 10 20`,
			`20 30`,
			true,
		},
		{
			"последнее втрой минимум",
			`-30 10 -20`,
			`-30 -20`,
			true,
		},
		{
			"последнее первый минимум",
			`-20 10 -30`,
			`-30 -20`,
			true,
		},
		{
			"одинаковые максимумы",
			`20 10 30 30`,
			`30 30`,
			true,
		},
		{
			"одинаковые минимумы",
			`20 10 -30 -30`,
			`-30 -30`,
			true,
		},
		{
			"произведение отрицательно",
			`20 -20`,
			`-20 20`,
			true,
		},
		{
			"произведение 0",
			`20 0`,
			`0 20`,
			true,
		},
		{
			"произведение 0",
			`-20 0`,
			`-20 0`,
			true,
		},
		{
			"два нуля",
			`0 0`,
			`0 0`,
			true,
		},
		{
			"три нуля",
			`0 0 0`,
			`0 0`,
			true,
		},
		{
			"четыре три нуля",
			`0 0 0 0`,
			`0 0`,
			true,
		},
		{
			"одинаковые положительные",
			`10 10 10 10 10`,
			`10 10`,
			true,
		},
		{
			"одинаковые отрицательные",
			`-10 -10 -10 -10`,
			`-10 -10`,
			true,
		},
		// TODO: Add test cases.
	}
	for _, tt := range tests {
		t.Run(tt.name, func(t *testing.T) {
			defer func(v bool) { debug = v }(debug)
			debug = tt.debug

			in := strings.NewReader(tt.input)
			out := &bytes.Buffer{}
			run(in, out, solve)
			if gotOut := out.String(); trimLines(gotOut) != trimLines(tt.wantOut) {
				t.Errorf("run() = %v, want %v", gotOut, tt.wantOut)
			}
		})
	}
}

func trimLines(text string) string {
	lines := strings.Split(text, "\n")
	for i, line := range lines {
		lines[i] = strings.TrimRight(line, " \t\r\n")
	}
	for n := len(lines); n > 0 && lines[n-1] == ""; n-- {
		lines = lines[:n-1]
	}
	return strings.Join(lines, "\n")
}
